---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.LineWeight
source: html/605a0923-f8f1-7e76-d836-cd4cf427a5e2.htm
---
# Autodesk.Revit.DB.MEPSystemType.LineWeight Property

Indicates the weight that should override the line weight for all components in the system.

## Syntax (C#)
```csharp
public int LineWeight { get; set; }
```